### 🔍 Workflow Analysis

#### Terraform Plan Insights
```
[command]/home/runner/work/_temp/d00f1c7e-4bb3-4a7e-bc30-abdc15d3a61f/terraform-bin plan -out=tfplan -lock=false -no-color
data.aws_route53_zone.domain_zone: Reading...
data.aws_route53_zone.domain_zone: Read complete after 0s [id=Z0147908X57MCN3YH0SW]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.ec2 will be created
  + resource "aws_instance" "ec2" {
      + ami                                  = "ami-005fc0f236362e99f"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.medium"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "devops-dojo"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "gitops"
        }
      + tags_...
(Plan output truncated)
```

#### Cost Estimation Overview
```
Project: main

 Name                                                       Monthly Qty  Unit                  Monthly Cost   
                                                                                                              
 aws_instance.ec2                                                                                             
 ├─ Instance usage (Linux/UNIX, on-demand, t3.medium)               730  hours                       $30.37   
 └─ root_block_device                                                                                         
    └─ Storage (general purpose SSD, gp2)                             8  GB                           $0.80   
                                                                                                              
 aws_route53_record.main_domain_record                                                                        
 ├─ Standard queries (first 1B)                        Monthly cost depends on usage: $0.40 per 1M queries    
 ├─ Latency based routing queries (first 1B)           Monthly cost depends on usage: $0.60 per 1M queries    
 └─ Geo DNS queries (first 1B)                         Monthly cost depends on usage: $0.70 per 1M queries    
                                                                                                              
 aws_route53_record.wildcard_domain_record                                                                    
 ├─ Standard queries (first 1B)                        Monthly cost depends on usage: $0.40 per 1M queries    
 ├─ Latency based routing queries (first 1B)           Monthly cost depends on usage: $0.60 per 1M queries    
 └─ Geo DNS queries (first 1B)                         Monthly cost depends on usage: $0.70 per 1M queries    
                                                                                                              
 OVERALL TOTAL                                                                                      $31.17 

*Usage costs can be estimated by updating Infracost Cloud settings, see docs for other options.

──────────────────────────────────
10 cloud resources were detected:
∙ 3 were estimated
∙ 7 were free

┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━┳━━━━━━━━━━━━┓
┃ Project                                            ┃ Baseline cost ┃ Usage cost* ┃ Total cost ┃
┣━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━╋━━━━━━━━━━━━┫
┃ main                                               ┃           $31 ┃           - ┃        $31 ┃
┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━┻━━━━━━━━━━━━┛

```

*Workflow Executed by @Afeez-AA*